icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    addEvent(newEvent);

	CK1_TIME = currentTime;

    if (this_clock->nextActor2 != NULL)
    {
        Event* newEvent2 = (Event*) malloc(sizeof(Event));
		*newEvent2 = *newEvent;
        newEvent2->actorToFire = this_clock->nextActor2;
        addEvent(newEvent2);
    }

    return;
}

/**
 * Set the firing flag of the actor, indicate that the actor is currenting being fired.
 */
void currentlyFiring(Actor* actor) {
	actor->firing = 1;
}

/** 
 * This is the fire method for computation.
 * Computation method do not have any real functionality here, where we simply
 * set our event queue to fire the next actor.
 */
void fireComputation(Actor* this_computation, Event* thisEvent) {

	double thisDouble;
	Event* newEvent = (Event*) malloc(sizeof(Event));;
        
	thisDouble = thisEvent->thisValue.doubleValue;
    thisDouble++;

	newEvent->thisValue.doubleValue = thisDouble;
    newEvent->actorToFire = this_computation->nextActor1;
    newEvent->actorFrom = this_computation;

    //arbitrarily delay either 1/4 of a sec or 1/2 of a sec or none.
	addEvent(newEvent);

    if (this_computation->nextActor2 != NULL)
    {
        Event* newEvent2 = (Event*) malloc(sizeof(Event));
		*newEvent2= *newEvent;
        newEvent2->actorToFire = this_computation->nextActor2;
        addEvent(newEvent2);
    }
}

/**
 This function is called when an error occures.
 */
void die(char *mess) { 
	perror(mess); 
	return; 
}

/** 
 * The method addEvent() is only used when an actor that's not the source 
 * within a platform.
 * In this case there's no need to lock the event queue since processEvents() 
 * only execute one event at a time.
 * When events are added, make sure the event queue is ordered by orderTag of the events.
 * Currently, we simply go through the queue one event at a time and check the tags.
 * FIXME: use either binary search or calendar to improve performance.
 */
void addEvent(Event* newEvent)
{

    Tag stampedTag = newEvent->Tag;

    //add an event
    Event *compare_event = EVENT_QUEUE_HEAD;
    Event *before_event = EVENT_QUEUE_HEAD;
    //move across the link until we find an event with larger tag, or stop at the end.

    while (1){
        if (compare_event == NULL)
            break;
        else if (stampedTag.timestamp < compare_event->Tag.timestamp)
                break;
        else if ((stampedTag.timestamp == compare_event->Tag.timestamp) && (
			stampedTag.microstep < compare_event->Tag.microstep))
                break;
        else {
            if (compare_event != before_event)
                before_event = before_event->next;
            compare_event = compare_event->next;
        }
    }
            
    newEvent->next = compare_event;
    if (compare_event == before_event){
        EVENT_QUEUE_HEAD = newEvent;
    }
    else if (compare_event != before_event){
        before_event->next = newEvent;
    }
    else {
//        printf("something wrong with compare and before _event\n");
        die("");
    }

}

/** 
 * removeEvent() is called to pop the most recent event in the event queue.
 * it is not interlocked because it can only be called by sinks within a 
 * platform, which is the called by processEvents().
 * Here the first event on the event queue is popped.
 */
void removeEvent()
{
    if (EVENT_QUEUE_HEAD != NULL){
        EVENT_QUEUE_HEAD = EVENT_QUEUE_HEAD -> next;
    } 
    else printf("event queue is already empty\n");
}

/** 
 * execute_event() checks if the event is valid. If it is, then fire actor
 * is called.
 */
void executeEvent(){

    if (EVENT_QUEUE_HEAD == NULL) {
        die("EVENT_QUEUE_HEAD should never be NULL\n");
    }
    else {
        if (EVENT_QUEUE_HEAD->actorToFire == NULL){
            die("executing an event where the actors are NULL!!\n");
        }
        else {
            fireActor(EVENT_QUEUE_HEAD);
        }
    }
}

/** 
 * fire_actor checks if static timing analysis is needed.
 * if it is, static timing analysis is called, and returns
 * if it's not, firing method of the actor specified by the event is called
 */
void fireActor(Event* currentEvent)
{

    Actor* fire_this = currentEvent->actorToFire;
	//FIXME: USE THIS INSTEAD!! char temp_type[3] = fire_this->type;
	if (fire_this->fireMethod != NULL) {
		(fire_this->fireMethod)(fire_this, currentEvent);
	} else {
		die("no such method, cannot fire\n");
	}
	fire_this->firing = 0;

    return;
}

///**fmod(x,y)
// * Code referenced from: http://www.koders.com/c/fid5C58ABB379EC1695145D6C137E954EAB07297C5C.aspx
// * changes were made to eliminate the need of floor function.
// */
//
//double fmod(double x, double y){
//    double f;
//    unsigned int i;
//    if (y == 0.0){
//        die("dividing by 0.0");
//    }
//
//    i = (unsigned int) (x/y);
//    f = x - (double)(i)*y;
//    if ((x < 0.0) != (y < 0.0))
//        f = f - y;
//    return f;
//}

/** 
 * This is the fire method for merge actor.
 * This firing method transfer the event at the input and put it to the output.
 * It also prints the current timestamp, and which actor it is from.
 * Since it is not a terminating actor, no need to pop event.
 * Only possibility to add event is when it has more than one output.
 * A merge actor may have more than one input.
 */
void fireMerge(Actor* this_merge, Event* thisEvent) {

//    printf("THIS IS THE FINAL OUTPUT OF THE MERGE Actor: \n");
//    printf("MAKE SURE THE TagS OF THESE EVENTS ARE IN ORDER: the tag on the current value are: %.9d.%9.9d %i \n", 
//		thisEvent->realTag.secs, thisEvent->Tag.nsecs, thisEvent->Tag.microstep);
//    printf("THIS OUTPUT WAS FROM Actor: %c%c%c\n", 
//		thisEvent->actorFrom->type[0], thisEvent->actorFrom->type[1], thisEvent->actorFrom->type[2]);

	Event* newEvent = (Event*)malloc(sizeof(Event));
	*newEvent = *thisEvent;
    newEvent->actorToFire = this_merge->nextActor1;
    newEvent->actorFrom = this_merge;

