icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
	addEvent(newEvent);

    if (this_merge->nextActor2 != NULL)
    {
        Event* newEvent2 = (Event*)malloc(sizeof(Event));
		*newEvent2 = *newEvent;
        newEvent2->actorToFire = this_merge->nextActor2;
        addEvent(newEvent2);
    }

    return;
}

/** 
 * This is the fire method for model_delay actor.
 * model_delay actor increase the current realTag timestamp by the the 
 * parameter MODEL_DELAY_SECS, where MODEL_DELAY_SECS is greater or equal 
 * to maximum delay from the source of the event to the sink.
 * At the same time, the orderTag is increased by BOUNDED_DELAY, since
 * this is the delay between the sensor actor and the merge actor.
 * Since timestamps are modified in this process, event_pop() and addEvent() 
 * needs to be called.
 * Because model_delay is also a transmitter through the network, socket
 * programming is used.
 */
void fireModelDelay(Actor* this_model_delay, Event* thisEvent) {

	unsigned int model_delay = 0;
/*
	if (this_model_delay ->type[2] == '1') {
		model_delay_secs = MODEL_DELAY1_SECS;
		model_delay_nsecs = MODEL_DELAY1_NSECS;
		bounded_delay_secs = BOUNDED_DELAY1_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY1_NSECS;
	}
	else if (this_model_delay ->type[2] == '2') {
		model_delay_secs = MODEL_DELAY2_SECS;
		model_delay_nsecs = MODEL_DELAY2_NSECS;
		bounded_delay_secs = BOUNDED_DELAY2_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY2_NSECS;
	}
	else if (this_model_delay ->type[2] == '3') {
		model_delay_secs = MODEL_DELAY3_SECS;
		model_delay_nsecs = MODEL_DELAY3_NSECS;
		bounded_delay_secs = BOUNDED_DELAY3_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY3_NSECS;
	}
	else {
		printf("this model delay does not exist!\n");
		exit(1);
	}
*/

	Event* newEvent = (Event*)malloc(sizeof(Event));
		
	newEvent->Tag.timestamp = thisEvent->Tag.timestamp + model_delay;
    newEvent->Tag.microstep = 0;   //FIXME
    newEvent->actorToFire = this_model_delay->nextActor1;
    newEvent->actorFrom = this_model_delay;

	addEvent(newEvent);
    if (this_model_delay->nextActor2 != NULL)
    {
        Event* newEvent2 = (Event*)malloc(sizeof(Event));
		*newEvent2 = *newEvent;
        newEvent2->actorToFire = this_model_delay->nextActor2;
        addEvent(newEvent2);
    }

    return;
}

void processEvents()
{

    //  To ensure this function is thread safe, we make sure only one processEvents() IS BEING EXECUTED AT A TIME
    //  WHILE ANOTHER SENSOR MIGHT TRIGGER ANOTHER processEvents()
    //  IF ANOTHER processEvents() is currently being executed, we don't really need to have another being executed at the same time...
	Actor* actor;

    while (1) {
        disableInterrupts();
        // If event queue is not empty.
        if (EVENT_QUEUE_HEAD != NULL) {
            Event* event = EVENT_QUEUE_HEAD;
            // Check which actor produced the event that we have processed
			actor = event->actorFrom;
			if (alreadyFiring(actor)) {
				enableInterrupts();
				break;
			} else {
	            long processTime = safeToProcess(event);
	            if (getCurrentPhysicalTime() >= processTime) {
	                removeEvent();
	                enableInterrupts();
	                // Execute the event. During
	                // this process more events may
	                // be posted to the queue.
	                fireActor(event);
					free(event);
	                // If the event just executed is
	                // produced by a source actor
	                if (actor->sourceActor != 0) {
	                    // Decrement the buffer size
	                    // by one.
						if (actor == SOURCE1) {
	                    	CK1_BUF_SIZE--;
						}
	                    // Make sure sourceBuffer is
	                    // non-empty. If it is, fire
	                    // the source actor once to
	                    // produce some events.
	                    if (CK1_BUF_SIZE == 0) {
							//dummyEVent is never used.
							Event* dummyEvent;
	                        fireClock(SOURCE1, dummyEvent);
							// firing of the actor should update the number of events in the buffer
	                    }
	                }
	            }
	            else {
	                // There are no events safe to
	                // process, so setup sources
	                // to process.
	                STOP_SOURCE_PROCESS = FALSE;
	                // Set timed interrupt to run
	                // the event at the top of the
	                // event queue when physical time
	                // has passed for it to be
	                // safe to process
	                setTimedInterrupt(processTime);
	                enableInterrupts();
	            }
			}
        } else {
            // There are no events safe to
            // process, so setup sources
            // to process.
            STOP_SOURCE_PROCESS = FALSE;
            enableInterrupts();
        }
        // If there is no event to process and we
        // have not reached the buffer limit, fire
        // the source actor.
        // for (each source actors a) {
        if (STOP_SOURCE_PROCESS == FALSE) {
			if (CK1_BUF_SIZE < MAX_BUFFER_LIMIT) {
				Event* dummyEvent;
            	fireClock(SOURCE1, dummyEvent);
			}
        }
    }
} 

/** 
 * This is the initialization method for sensor actor.
 * Initialize the sensor actor to setup receiving function through another 
 * thread, it then create a new event and calls processEvent()
 */
void initSensor(Actor* this_sensor)     //this listens for the next signal to sense again
{
	long time;
    Event* newEvent = (Event*)malloc(sizeof(Event));
    //get the current time
    time = getCurrentPhysicalTime();

    // Set a time trigger from now

    newEvent->Tag.timestamp = time;
    newEvent->Tag.microstep = 0;	//FIXEM
    newEvent->thisValue.doubleValue = time;
    newEvent->actorToFire = this_sensor->nextActor1;
    newEvent->actorFrom = this_sensor;

    //now put the created event into the queue
    //BUT HOW DO I TRACK THE START OF THE EVENT QUEUE??? --global variable
    addEvent(newEvent);

    if (this_sensor->nextActor2 != NULL)
    {
        Event* newEvent2 = (Event*)malloc(sizeof(Event));
		*newEvent2 = *newEvent;
        newEvent2->actorToFire = this_sensor->nextActor2;
        addEvent(newEvent2);
    }

    return;
}

/** 
 * Static timing analysis is called to set the timestamp of the event by a 
 * specific amount in order to fire the event at an instance that ensures 
 * all events are exectued in order.
 * In this analysis, the clock event can be executed when real time exceeds
 * tau - model_delay3
 */
long safeToProcess(Event* thisEvent) {

