icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    long safeTimestamp = thisEvent->Tag.timestamp;

	if (thisEvent->actorToFire->multipleInputs != 0) {
	    if (thisEvent->actorToFire->fireMethod == fireMerge)
		{
			safeTimestamp -= MERGE_MODEL_TIME_ADJUSTMENT; 
		} else if (thisEvent->actorToFire->fireMethod == fireComputation)
	    {        
	    	safeTimestamp -= COMPUTATION_MODEL_TIME_ADJUSTMENT;
		}
    } else {
//        printf("always safe to execute, so set safeTag to 0\n");
        safeTimestamp = 0;
    }

    return safeTimestamp;
}

void setActuationInterrupt(long actuationTime) {
	return;
}

void setTimedInterrupt(long safeToProcessTime) {
	return;
}

long getCurrentPhysicalTime() {
	return 0;
}

//*****************************************************************************
//
// The UART interrupt handler.
//
//*****************************************************************************
void
UARTIntHandler(void)
{
    unsigned long ulStatus;
	Event* dummyEvent;
	
	disableInterrupts();

    //
    // Get the interrrupt status.
    //
    ulStatus = UARTIntStatus(UART0_BASE, true);
    //
    // Clear the asserted interrupts.
    //
    UARTIntClear(UART0_BASE, ulStatus);

	fireClock(SOURCE1, dummyEvent);

	enableInterrupts();
	
	processEvents();	

	// If processEvents() is currently trying
    // to fill the output buffer of source
    // actors, go back to the start of
    // while(TRUE) in processEvents().		
	STOP_SOURCE_PROCESS = TRUE;
}

//FIXME: which interrupt(s) should I disable/enable?
void disableInterrupts() {
	IntMasterDisable();
	IntDisable(INT_UART0);
	UARTIntDisable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
}

void enableInterrupts() {
	IntMasterEnable();
    IntEnable(INT_UART0);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
} 


/**
 * A thread is setup to keep listening for timed interrupt.
 * This scheme makes sure that no interrupts are missed.
 * Asumming: if real time has passed the timed trigger, the timebomb would still explode.
 */
/*
void timed_interrupt_init(){
    // Block until the next interrupt
    unsigned int status;
    printf("\nSTART LISTENING FOR INTERRUPTS.\n\n");
    while (1) {
        do {
            //HOW DO I PASS THE fd TO THIS FUNCTION? --> by global variable
            int num = read( fd, &status, sizeof(status));
            if (num != sizeof( status))
            {
                fprintf(stderr, "Error reading status, %d\n", num);
                die();
            }
        } while ((status & TIMEBOMB_0_FIRE) == 0); // Got it!
        
        printf("wake up man! I got an event to execute!!\n");
        pthread_t  p_thread;
        //Time has passed to allow safe execution of events on event queue.
        int thr_id;
        //FIXME FIXME FIXME: after a while I just can't create anymore threads???
        thr_id = pthread_create(&p_thread, NULL, (void*)processEvents, (void*)NULL);

    }
}
*/
/**
 * main() has the following functionalities:
 * declare all actors
 * setup dependencies between the actors
 * intialize actors
 */
int main(int argc, char *argv[])
{

//    GLOBAL_SERVER = argv[1];
//    GLOBAL_PORT1 = argv[2];
//    GLOBAL_PORT2 = argv[3];

    //**************************************************
    //Declare all actors
    Actor sensor1;
	Actor sensor2;
    Actor clock1;
	Actor computation1;
	Actor computation2;
	Actor computation3;
    Actor merge1;
    Actor model_delay1;
	Actor model_delay2;
    Actor model_delay3;
    Actor actuator1;

	/*************************************************************************/
	// Utilities to setup interrupts
    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
	//
    // Enable processor interrupts.
    //
    IntMasterEnable();	
    //
    // Set GPIO A0 and A1 as UART pins.
    //
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
	//
    // Configure the UART for 115,200, 8-N-1 operation. 
	// FIXME: don't know what this is for...
    //
    UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200,
                        (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                         UART_CONFIG_PAR_NONE));
    //
    // Enable the UART interrupt.
    //
    IntEnable(INT_UART0);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	/*************************************************************************/

    if (argc != 5) {
        fprintf(stderr, "USAGE: %s <server_ip> <port1> <port2> <s or a>\n", argv[0]);
        //s stands for sensor side
        //a stands for actuator side
        die("");
    }

	SOURCE1 = &clock1;

	clock1.fireMethod = fireClock;

	computation1.fireMethod = fireComputation;

	computation2.fireMethod = fireComputation;

	computation3.fireMethod = fireComputation;

	model_delay1.fireMethod = fireModelDelay;

	model_delay2.fireMethod = fireModelDelay;

	model_delay3.fireMethod = fireModelDelay;

	merge1.fireMethod = fireMerge;

	actuator1.fireMethod = fireActuator;
  
    //Dependencies between all the actors
	//FIXME: HOW ARE PORTS NUMBERED??
    sensor1.nextActor1 = &computation1;
    sensor1.nextActor2 = NULL;
    computation1.nextActor1 = &model_delay1;
    computation1.nextActor2 = NULL;
	model_delay1.nextActor1 = &merge1;
	model_delay1.nextActor2 = NULL;

    sensor2.nextActor1 = &computation2;
    sensor2.nextActor2 = NULL;
    computation2.nextActor1 = &model_delay2;
    computation2.nextActor2 = NULL;
	model_delay2.nextActor1 = &merge1;
	model_delay2.nextActor2 = NULL;
    
    clock1.nextActor1 = &computation3;
    clock1.nextActor2 = NULL;
    computation3.nextActor1 = &merge1;
    computation3.nextActor2 = NULL;
    
    merge1.nextActor1 = &actuator1;
    merge1.nextActor2 = NULL;

    actuator1.nextActor1 = NULL;
    actuator1.nextActor2 = NULL;
    
    //initialize all actors
    //if a, it's an actuator
    //if s, it's a sensor
    //if neither, error
/*    pthread_t  p_thread;
    //Time has passed to allow safe execution of events on event queue.
    int thr_id;
    thr_id = pthread_create(&p_thread, NULL, (void*)timed_interrupt_init, (void*)NULL);
*/
    //initializeAllActors();

    if (*argv[4] == 's'){
        //sensor_init is used to startup the system by sending an event.
        initSensor(&sensor1);
    }
    else if (*argv[4] == 'a'){
        //sensor_run is used to listen for events that comes from the sensor platform.
		initClock(&clock1);
        initSensor(&sensor2);
    }
    else
        printf("didn't not specify if this is an actuator or sensor!!!\n");

    //go idle
    processEvents();
    
//    close(fd);

